Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/include/proc/p32mz2025das176.h
extern volatile __GLCDCLUT99bits_t GLCDCLUT99bits __asm__ ("GLCDCLUT99") __attribute__((section("sfrs"), address(0xBF8EA58C)));
#define GLCDCLUT100 GLCDCLUT100
extern volatile uint32_t   GLCDCLUT100 __attribute__((section("sfrs"), address(0xBF8EA590)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT100bits_t;
extern volatile __GLCDCLUT100bits_t GLCDCLUT100bits __asm__ ("GLCDCLUT100") __attribute__((section("sfrs"), address(0xBF8EA590)));
#define GLCDCLUT101 GLCDCLUT101
extern volatile uint32_t   GLCDCLUT101 __attribute__((section("sfrs"), address(0xBF8EA594)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT101bits_t;
extern volatile __GLCDCLUT101bits_t GLCDCLUT101bits __asm__ ("GLCDCLUT101") __attribute__((section("sfrs"), address(0xBF8EA594)));
#define GLCDCLUT102 GLCDCLUT102
extern volatile uint32_t   GLCDCLUT102 __attribute__((section("sfrs"), address(0xBF8EA598)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT102bits_t;
extern volatile __GLCDCLUT102bits_t GLCDCLUT102bits __asm__ ("GLCDCLUT102") __attribute__((section("sfrs"), address(0xBF8EA598)));
#define GLCDCLUT103 GLCDCLUT103
extern volatile uint32_t   GLCDCLUT103 __attribute__((section("sfrs"), address(0xBF8EA59C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT103bits_t;
extern volatile __GLCDCLUT103bits_t GLCDCLUT103bits __asm__ ("GLCDCLUT103") __attribute__((section("sfrs"), address(0xBF8EA59C)));
#define GLCDCLUT104 GLCDCLUT104
extern volatile uint32_t   GLCDCLUT104 __attribute__((section("sfrs"), address(0xBF8EA5A0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT104bits_t;
extern volatile __GLCDCLUT104bits_t GLCDCLUT104bits __asm__ ("GLCDCLUT104") __attribute__((section("sfrs"), address(0xBF8EA5A0)));
#define GLCDCLUT105 GLCDCLUT105
extern volatile uint32_t   GLCDCLUT105 __attribute__((section("sfrs"), address(0xBF8EA5A4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT105bits_t;
extern volatile __GLCDCLUT105bits_t GLCDCLUT105bits __asm__ ("GLCDCLUT105") __attribute__((section("sfrs"), address(0xBF8EA5A4)));
#define GLCDCLUT106 GLCDCLUT106
extern volatile uint32_t   GLCDCLUT106 __attribute__((section("sfrs"), address(0xBF8EA5A8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT106bits_t;
extern volatile __GLCDCLUT106bits_t GLCDCLUT106bits __asm__ ("GLCDCLUT106") __attribute__((section("sfrs"), address(0xBF8EA5A8)));
#define GLCDCLUT107 GLCDCLUT107
extern volatile uint32_t   GLCDCLUT107 __attribute__((section("sfrs"), address(0xBF8EA5AC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT107bits_t;
extern volatile __GLCDCLUT107bits_t GLCDCLUT107bits __asm__ ("GLCDCLUT107") __attribute__((section("sfrs"), address(0xBF8EA5AC)));
#define GLCDCLUT108 GLCDCLUT108
extern volatile uint32_t   GLCDCLUT108 __attribute__((section("sfrs"), address(0xBF8EA5B0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT108bits_t;
extern volatile __GLCDCLUT108bits_t GLCDCLUT108bits __asm__ ("GLCDCLUT108") __attribute__((section("sfrs"), address(0xBF8EA5B0)));
#define GLCDCLUT109 GLCDCLUT109
extern volatile uint32_t   GLCDCLUT109 __attribute__((section("sfrs"), address(0xBF8EA5B4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT109bits_t;
extern volatile __GLCDCLUT109bits_t GLCDCLUT109bits __asm__ ("GLCDCLUT109") __attribute__((section("sfrs"), address(0xBF8EA5B4)));
#define GLCDCLUT110 GLCDCLUT110
extern volatile uint32_t   GLCDCLUT110 __attribute__((section("sfrs"), address(0xBF8EA5B8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT110bits_t;
extern volatile __GLCDCLUT110bits_t GLCDCLUT110bits __asm__ ("GLCDCLUT110") __attribute__((section("sfrs"), address(0xBF8EA5B8)));
#define GLCDCLUT111 GLCDCLUT111
extern volatile uint32_t   GLCDCLUT111 __attribute__((section("sfrs"), address(0xBF8EA5BC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT111bits_t;
extern volatile __GLCDCLUT111bits_t GLCDCLUT111bits __asm__ ("GLCDCLUT111") __attribute__((section("sfrs"), address(0xBF8EA5BC)));
#define GLCDCLUT112 GLCDCLUT112
extern volatile uint32_t   GLCDCLUT112 __attribute__((section("sfrs"), address(0xBF8EA5C0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT112bits_t;
extern volatile __GLCDCLUT112bits_t GLCDCLUT112bits __asm__ ("GLCDCLUT112") __attribute__((section("sfrs"), address(0xBF8EA5C0)));
#define GLCDCLUT113 GLCDCLUT113
extern volatile uint32_t   GLCDCLUT113 __attribute__((section("sfrs"), address(0xBF8EA5C4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT113bits_t;
extern volatile __GLCDCLUT113bits_t GLCDCLUT113bits __asm__ ("GLCDCLUT113") __attribute__((section("sfrs"), address(0xBF8EA5C4)));
#define GLCDCLUT114 GLCDCLUT114
extern volatile uint32_t   GLCDCLUT114 __attribute__((section("sfrs"), address(0xBF8EA5C8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT114bits_t;
extern volatile __GLCDCLUT114bits_t GLCDCLUT114bits __asm__ ("GLCDCLUT114") __attribute__((section("sfrs"), address(0xBF8EA5C8)));
#define GLCDCLUT115 GLCDCLUT115
extern volatile uint32_t   GLCDCLUT115 __attribute__((section("sfrs"), address(0xBF8EA5CC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT115bits_t;
extern volatile __GLCDCLUT115bits_t GLCDCLUT115bits __asm__ ("GLCDCLUT115") __attribute__((section("sfrs"), address(0xBF8EA5CC)));
#define GLCDCLUT116 GLCDCLUT116
extern volatile uint32_t   GLCDCLUT116 __attribute__((section("sfrs"), address(0xBF8EA5D0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT116bits_t;
extern volatile __GLCDCLUT116bits_t GLCDCLUT116bits __asm__ ("GLCDCLUT116") __attribute__((section("sfrs"), address(0xBF8EA5D0)));
#define GLCDCLUT117 GLCDCLUT117
extern volatile uint32_t   GLCDCLUT117 __attribute__((section("sfrs"), address(0xBF8EA5D4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT117bits_t;
